"""
    কুইক সর্ট এর মূলে আছে রিকার্শন । আমরা একটা আইটেম কে কেন্দ্র করে ঐ আইটেমের চেয়ে ছোট এবং বড় আইটেম গুলো
    আলাদা লিস্টে নিয়ে নিবো । এতে আমাদের মূল লিস্ট ছোট ছোট লিস্টে ভাগ হয়ে গেলো । এইবার ঐ ছোট লিস্ট গুলোকে আবার
    রিকার্সিভলি কুইক সর্ট করবো । এতে লিস্ট বার বার ছোট থেকে আরও ছোট হয়ে যাবে । ছোট হতে হতে যখন কোন লিস্ট এ একটা বা শূন্য
    সংখ্যক আইটেম থাকবে তখন ঐ লিস্ট এমনিতেই সর্টেড হয়ে যাবে । তখন এই সর্টেড লিস্ট গুলো জোড়া লাগালে মূল লিস্টের সর্টেড ভার্সন
    পেয়ে যাবো ।


"""


def quick_sort(lst):
    # দুই এর চেয়ে কম আইটেম থাকলে আর সর্ট করার দরকার নাই, ঐটা এমনিতেই সর্টেড
    # এইটাই রিকার্শনের বেইজ কেইস - এই জায়গায় পৌছালে আর রিকার্সিভ কলের দরকার নাই
    if len(lst) < 2:
        return lst

    # লিস্টের সাইজ বড়, তাই একটা আইটেম নিয়ে তার চেয়ে ছোট এবং বড় আইটেম গুলো আলাদা লিস্টে নিয়ে নিবো
    pivot = lst[0]
    lowers = [x for x in lst[1:] if x <= lst[0]]
    highers = [x for x in lst[1:] if x > lst[0]]

    # ঐ লিস্ট গুলোকে রিকার্সিভলি সর্ট করে এইবার জোড়া লাগানোর পালা 
    return quick_sort(lowers) + [pivot] + quick_sort(highers)


if __name__ == "__main__":
    l = [2, 3, 1, 0, 9, 2, 6, 7]

    print(quick_sort(l))
